
// function updateCalendar() {
//     const now = new Date();


//     // добавить логику для расчета текущего цикла
//     // определение небесн и зв 


//     //  заполняеем таблицу
//     const cells = document.querySelectorAll('#luoshu td');
//     cells.forEach((cell, index) => {
//         cell.textContent = `Элемент ${index + 1}`; 
//     });
// }

// setInterval(updateCalendar, 1000); // обновление каждую cttreyle 
// updateCalendar();



// декады 

//  戊     1 Декада 甲子, 乙丑, 丙寅, 丁卯, 戊辰, 己巳, 庚午, 辛未, 壬申, 癸酉

// 己      2 Декада 甲戌, 乙亥, 丙子, 丁丑, 戊寅, 己卯, 庚辰, 辛巳, 壬午, 癸未

// 庚      3 Декада 甲申, 乙酉, 丙戌, 丁亥, 戊子, 己丑, 庚寅, 辛卯, 壬辰, 癸巳

// 辛      4 Декада 甲午, 乙未, 丙申, 丁酉, 戊戌, 己亥, 庚子, 辛丑, 壬寅, 癸卯

// 壬      5 Декада 甲辰, 乙巳, 丙午, 丁未, 戊申, 己酉, 庚戌, 辛亥, 壬子, 癸丑

// 癸      6 Декада 甲寅, 乙卯, 丙辰, 丁巳, 戊午, 己未, 庚申, 辛酉, 壬戌, 癸亥

// добавить взможность проставлять дату. и получать расчеты относительнно этой даты

// Расчета благоприятных направлений с целью получения наиболее оптимального результата. расклад должен предоставлять сразу инфу по направленниям в которых хорошо ходить. безопасные. врота счастливые плюс мистик. . на первое местоо где нет гена. и рейтинг давать направлениям. 

// сделать автопоиск по датам. будет пказывать чт есть на эту дату хорошего для активаций и прогулок. поиск на деень вперед. на неделю вперед. на месяц вперед. на год вперед. 

// сдеелать поиск на индивидуальное. то же самое

// поиск по цели задачи. пороождение от ннужых элементов. 

// поиск направлений с хоршими структурми прождающие челвека. по дню и по часу свпадающие. для дальих пездоок. 

// реализация списка активаций в виде ежедневника. еженедельнника. и уведмления в приложении с телефонна. или в телеграм канале от бота. 

// анимация миганния что сейчас активна определеная хорошая активация. пора в прогулку или пставьте свечку там то там то. и отдельно ссылка на страницу с описанием активации. 

// взможность выставления своего гда рждения. и определение благоприятности активаций и вывд списка. 

// djpvj;y возможнность выбрать нужнное направление. и поиск ближайших активаций часовых. прогулок. плюс выбор своего года. или других годов. кому подходит. чтобы н екнтролировало. снначала вывдит то что прождает. птм то что равно/ самые сильные на совпаденнии с днневными. Например, выбрав благоприятное направление, 

// поиск структур, где ворота прибыли и ву пороождают нс года или нс дня. а также порождают друг друга. тоже рейтинг в зависимости от ситуации. 

// пройти собеседование для работы труктуры. где ворота открытия порождают ннс дння и нс года. 

// djpvj;y возможность выбора что должно меня порождать. и выдает список всех часовых и тд 

// выводить общие эффективные часы выводить и подсвечивать зелененьким. нс часа порождает нс дня. и более рейтинговыее когда нс часа порждает не только нс дня но и нс года. 

// 




